In [1]:
import pandas as pd

In [3]:
pd.__version__

'0.24.1'

In [4]:
ser = pd.Series(['张三','李四','王五'])
ser

0    张三
1    李四
2    王五
dtype: object

In [5]:
list(range(1,4))

[1, 2, 3]

In [9]:
ser = pd.Series(['张三','李四','王五'],index = list(range(1,4)))
ser

1    张三
2    李四
3    王五
dtype: object

In [14]:
ser[2]

'李四'

In [15]:
ser[2] = 'Martin'

In [16]:
ser

1        张三
2    Martin
3        王五
dtype: object

In [17]:
ind = [1,3]

In [18]:
ser[ind]

1    张三
3    王五
dtype: object

In [19]:
type(ser)

pandas.core.series.Series

In [20]:
ser.values

array(['张三', 'Martin', '王五'], dtype=object)

In [21]:
type(ser.values)

numpy.ndarray

In [24]:
ser2  = pd.Series([18,19,17],index=range(1,4))
ser2

1    18
2    19
3    17
dtype: int64

In [25]:
ser2 + 1

1    19
2    20
3    18
dtype: int64

In [26]:
ser2[ser2%2==0]

1    18
dtype: int64

In [28]:
data = {'beijing':9240,'shanghai':8960,'gaungzhou':7400}
data

{'beijing': 9240, 'shanghai': 8960, 'gaungzhou': 7400}

In [31]:
ser3 = pd.Series(data)
ser3

beijing      9240
shanghai     8960
gaungzhou    7400
dtype: int64

In [32]:
ser3['beijing']

9240

In [34]:
'beijing' in ser3

True

In [36]:
ser4 = pd.Series(data,index=['beijing','shanghai','shenzhen'])
ser4

beijing     9240.0
shanghai    8960.0
shenzhen       NaN
dtype: float64

In [37]:
ser4.to_dict()

{'beijing': 9240.0, 'shanghai': 8960.0, 'shenzhen': nan}

In [38]:
ser4.tolist()

[9240.0, 8960.0, nan]

In [39]:
ser4.to_json

<bound method NDFrame.to_json of beijing     9240.0
shanghai    8960.0
shenzhen       NaN
dtype: float64>

In [40]:
ser4.to_json()

'{"beijing":9240.0,"shanghai":8960.0,"shenzhen":null}'

In [42]:
ser4.to_frame()

               0
beijing   9240.0
shanghai  8960.0
shenzhen     NaN

# DataFrame

In [47]:
import numpy as np
data = np.arange(100,109).reshape(3,-1)
data

array([[100, 101, 102],
       [103, 104, 105],
       [106, 107, 108]])

In [49]:
df=pd.DataFrame(data)   #利用data数据创建一个DataFrame
df

     0    1    2
0  100  101  102
1  103  104  105
2  106  107  108

In [53]:
data = {
    'name':['Jack','Mary','Martin'],
    'age':[19,17,18],
    'height':[172,168,177]
}
qq = pd.DataFrame(data)
qq

     name  age  height
0    Jack   19     172
1    Mary   17     168
2  Martin   18     177

In [56]:
qq.columns = ['username','age','height']

In [57]:
qq

  username  age  height
0     Jack   19     172
1     Mary   17     168
2   Martin   18     177

In [3]:
import numpy as np
import pandas as pd
data = {
    'name':['Jack','Mary','Martin'],
    'age':[19,17,18],
    'height':[172,168,177]
}
qq = pd.DataFrame(data)
qq

     name  age  height
0    Jack   19     172
1    Mary   17     168
2  Martin   18     177

In [5]:
df = pd.DataFrame(data,columns=['name','age','height','email'])
df

     name  age  height email
0    Jack   19     172   NaN
1    Mary   17     168   NaN
2  Martin   18     177   NaN

In [6]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
df = pd.DataFrame(data,columns=['name','age','height','email'],index=range(1,4))
df

     name  age  height email
1    Jack   19     172   NaN
2    Mary   17     168   NaN
3  Martin   18     177   NaN